
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура пд_ПриЗаписи(Отказ, Замещение)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		пд_ОбменСLegendCity.ЗарегистрироватьИзмененияПродажи(ЭтотОбъект.Отбор.Регистратор.Значение, Неопределено);
		
	Иначе 
	
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			пд_ОбменСLegendCity.ЗарегистрироватьИзмененияПродажи(Запись.Регистратор, Запись.ДисконтнаяКарта, Запись.Сумма);	

		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли