#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ПриЗаписи")
Процедура пд_ПриЗаписи(Отказ, Замещение)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		пд_ОбменСLegendCity.ЗарегистрироватьИзмененияБонусов(ЭтотОбъект.Отбор.Регистратор.Значение, Неопределено, 0);
		
	Иначе 
	
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			Если (Запись.ВидДвижения = ВидДвиженияНакопления.Расход И ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.НачислениеИСписаниеБонусныхБаллов"))
				Или Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				
				пд_ОбменСLegendCity.ЗарегистрироватьИзмененияБонусов(Запись.Регистратор, Запись.ДисконтнаяКарта, Запись.Начислено);
				
			КонецЕсли;	
			
		КонецЦикла;  
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли