#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура пд_ПриЗаписи(Отказ, Замещение)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Начислено > 0 Тогда
			
			пд_ОбменСLegendCity.ЗарегистрироватьИзменения(Запись.Регистратор, Запись.ДисконтнаяКарта, Запись.Начислено);
			
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли