#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура пд_ПриЗаписи(Отказ, Замещение)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		пд_ОбменСLegendCity.ЗарегистрироватьИзменения(ЭтотОбъект.Отбор.Регистратор.Значение, Неопределено, 0);
		
	Иначе 
	
		Для Каждого Запись Из ЭтотОбъект Цикл
		
			Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				пд_ОбменСLegendCity.ЗарегистрироватьИзменения(Запись.Регистратор, Запись.ДисконтнаяКарта, Запись.Начислено);	
			ИначеЕсли Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
				пд_ОбменСLegendCity.ЗарегистрироватьИзменения(Запись.Регистратор, Запись.ДисконтнаяКарта, -Запись.Начислено);	
			КонецЕсли;
		
		КонецЦикла;  
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли